constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            patch;
        nFaces          23520;
        startFace       1987728;
    }
    inlet
    {
        type            patch;
        nFaces          1764;
        startFace       2011248;
    }
    outlet
    {
        type            patch;
        nFaces          2064;
        startFace       2013012;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11760;
        startFace       2015076;
    }
    upperWall
    {
        type            patch;
        nFaces          11760;
        startFace       2026836;
    }
)

// ************************************************************************* //
