0.org/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 7.0;
Href                 0.1875;
z0                   uniform 1.5;
//turbulentKE          1.3;
windDirection        (1 0 0);
zDirection           (0 0 1);
zGround              uniform 0.0;
// ************************************************************************* //
