0.org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (6.82 0 0);
pressure             0;
turbulentKE          0.001744215;//I= .5% 
turbulentEpsilon       0.004224425;// l = 1.5mm
#inputMode           merge

// ************************************************************************* //
