0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"
    //#include "include/ABLConditions"
    //- Define inlet conditions
    //#include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE; //$internalField;
        value           $internalField;
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant $turbulentKE;
    }

    lowerWall
    {
        //type            kqRWallFunction;
        //value           uniform 0.0;
          type slip;
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
