system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    hub
    {
        type    uniform;
        axis    x;
        start   (0 1.5 .75);
        end     (40 1.5 .75);
        nPoints 321;
    }

    data_1D
    {
        type    uniform;
        axis    z;
        start   (35.25 1.5 0);
        end     (35.25 1.5 1);
        nPoints 33;
    }

    data_2D
    {
        type    uniform;
        axis    z;
        start   (35.5 1.5 0);
        end     (35.5 1.5 1);
        nPoints 33;
    }

    data_4D
    {
        type    uniform;
        axis    z;
        start   (36 1.5 0);
        end     (36 1.5 1);
        nPoints 33;
    }

    data_6D
    {
        type    uniform;
        axis    z;
        start   (36.5 1.5 0);
        end     (36.5 1.5 1);
        nPoints 33;
    }

    data_8D
    {
        type    uniform;
        axis    z;
        start   (37 1.5 0);
        end     (37 1.5 1);
        nPoints 33;
    }

    data_10D
    {
        type    uniform;
        axis    z;
        start   (37.5 1.5 0);
        end     (37.5 1.5 1);
        nPoints 33;
    }

    data_20D
    {
        type    uniform;
        axis    z;
        start   (39.999 1.5 0);
        end     (39.999 1.5 1);
        nPoints 33;
    }

);

fields          (U p k epsilon);

// ************************************************************************* //
